diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоговорыИРеализацииЗаПериод</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

diplom-src/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция МассовоеСозданиеРеализацийТоваровИУслуг(Период) Экспорт

	СписокДоговоров = СпискоДоговоровДляАктов(Период);

	Если СписокДоговоров.Пустой() Тогда
		ТекстШаблона = "За выбранный период данных нет";
		ОбщегоНазначения.СообщитьПользователю(ТекстШаблона);
		Возврат ТекстШаблона;
	Иначе
		ТаблицаДоговоров = СписокДоговоров.Выгрузить();
		МассивДанных = СоздатьДокументыРеализацияТоваровИУслуг(ТаблицаДоговоров, Период);
	КонецЕсли;

	Возврат МассивДанных;

КонецФункции

Функция СпискоДоговоровДляАктов(Период)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Договор
	|ПОМЕСТИТЬ ВТ_ДокументРеализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&МесяцОтчета, Месяц) И КОНЕЦПЕРИОДА(&МесяцОтчета, Месяц)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействия >= НАЧАЛОПЕРИОДА(&МесяцОтчета, Месяц)
	|	И НЕ ДоговорыКонтрагентов.Ссылка В
	|		(ВЫБРАТЬ
	|			ВТ_ДокументРеализации.Договор КАК Договор
	|		ИЗ
	|			ВТ_ДокументРеализации КАК ВТ_ДокументРеализации)
	|	И ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействия <= КОНЕЦПЕРИОДА(&МесяцОтчета, Месяц)";

	Запрос.УстановитьПараметр("МесяцОтчета", Период);

	Возврат Запрос.Выполнить();

КонецФункции

Функция СоздатьДокументыРеализацияТоваровИУслуг(ТаблицаДоговоров, Период)

	МассивДанных = Новый Массив;

	Для Каждого Док Из ТаблицаДоговоров Цикл

		Документ = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		ДатаДокумента = ТекущаяДатаСеанса();
		Документ.Дата = ?(ДатаДокумента > КонецМесяца(Период), КонецМесяца(Период), ДатаДокумента);
		Документ.Организация = Док.Договор.Организация;
		Документ.Контрагент = Док.Договор.Владелец;
		Документ.Ответственный = Пользователи.ТекущийПользователь();
		Документ.Основание = Док.Договор;
		ЗаполнитьЗначенияСвойств(Документ, Док);
		Документ.Записать(РежимЗаписиДокумента.Запись);
		Документ.ВыполнитьАвтозаполнение();;
		Документ.Записать(РежимЗаписиДокумента.Запись);
		Если Документ.ПроверитьЗаполнение() Тогда
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не проведен. %1 не прошел проверку на заполнение",
				Документ.Ссылка));
		КонецЕсли;

		МассивДанных.Добавить(Документ.Ссылка);

	КонецЦикла;

	Возврат МассивДанных;

КонецФункции

#КонецОбласти

#КонецЕсли
